app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Zoology"], ["room_number", 2], ["created_at", "2020-05-07 20:45:07.519165"], ["updated_at", "2020-05-07 20:45:07.519165"]]
---
  def create
    @school_class = SchoolClass.new(school_class_params)
    if @school_class.save

UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 13], ["updated_at", "2020-05-07 20:44:54.161411"], ["id", 1]]
---
  def update
    if @school_class.update(school_class_params)

DELETE FROM "school_classes" WHERE "school_classes"."id" = ?  [["id", 1]]
---
  def destroy
    @school_class.destroy