app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)
    if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Anthony"], ["last_name", "Bois"], ["created_at", "2020-05-07 20:35:14.695056"], ["updated_at", "2020-05-07 20:35:14.695056"]]

  def update
    if @student.update(student_params)
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Bo"], ["updated_at", "2020-05-07 20:36:34.610822"], ["id", 3]]